Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: མཁས་པ་ཏོག་ཡིན་གླང་པོ་རྫུ་འཕྲུལ་ཅན། །
en: Crest will be the scholar and Elephant the one of miracles.

source: འདུས་པ་དང་པོ་དག་ཏུ་དགྲ་བཅོམ་པ། །བྱེ་བ་བརྒྱ་ཕྲག་ཉི་ཤུ་གཉིས་པར་ཡང་། །ཉིས་འགྱུར་གསུམ་པ་དག་ཏུ་སུམ་འགྱུར་ཡོད། །
en: “In the first congregation there will be two billion two hundred million worthy ones; In the second there will be double that amount; and in the third there will be three times that many.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་ཚུལ། །ལོ་གྲངས་ལྔ་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: And after he has attained parinirvāṇa, “His sacred Dharma will remain for fifty-six thousand years.

source: དེ་ཡི་སྐུ་གདུང་རྣམས་ཀྱང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་སུམ་ཅུ་གཉིས། །
en: His relics will be abundant, And there will be three billion two hundred million stūpas.

source: དེ་བཞིན་གཤེགས་པ་བསྙེངས་དང་བྲལ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་བརྒྱན་ཅེས་བྱ། །
en: The thus-gone Vigatabhaya will be born “In a place called Flower Ornament.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཁྲི་ཡོད་ཡབ་ནི་ལེགས་ཡིད་གཞུངས། །ཆོས་ཀྱི་དབང་ཕྱུག་ཅེས་བྱ་དེ་ཡི་ཡུམ། །
en: His family will be kṣatriya, And his light will cover ten thousand leagues. Fine and Noble Mind will be his father and Dharma Master his mother.

source: སྲས་པོ་རྣམ་འཕྲུལ་རྒྱལ་ནི་རིམ་གྲོ་པ། །
en: “Miracle will be his son and Conqueror his attendant.

source: ཐེ་ཙོམ་གཅོད་ཅེས་བྱ་བ་ཤེས་རབ་ཅན། །
en: Cutting through Doubt will be the one of insight

source: བརྟུལ་ཞུགས་མི་གཡོ་བ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Unwavering Yogic Discipline the one of miracles.

source: འདུས་པ་དང་པོར་བསམ་གཏན་པ་ཚོགས་པ། །ཐེར་འབུམ་ཁྲི་ཕྲག་བརྒྱད་ཅུ་འདུས་པར་འགྱུར། །
en: In the first congregation there will be eighty trillion meditators;

source: གཉིས་པར་བདུན་ཅུ་གསུམ་པར་དྲུག་ཅུ་ཡོད། །གཞན་རྣམས་ཀུན་ཏུ་བྱེ་བརྒྱ་ཚང་བར་འགྱུར། །
en: “In the second there will be seventy trillion; in the third sixty trillion; And in all the others there will be one billion.

source: མི་རྣམས་དག་གི་ཚེ་ཚད་ལོ་གྲངས་ནི། །བྱེ་བ་སུམ་ཅུ་རྩ་དྲུག་ཐམ་པ་ཡིན། །
en: The lifespan of humans will be three hundred sixty million years,

source: དམ་ཆོས་བརྒྱད་འགྱུར་གནས་ཤིང་སྐུ་གདུང་ནི། །
en: And his sacred Dharma will remain for three hundred eighty million years.

source: རིལ་གཅིག་མཆོད་རྟེན་དཔག་ཚད་ལྔ་ཙམ་མོ། །
en: “His relics will remain in one collection within a five-league large stūpa.

source: དེ་བཞིན་གཤེགས་པ་མཆོད་འོས་ལྷ་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བའི་བློ་ཞེས་བྱ། །
en: The thus-gone Arhaddeva will be born In a place called Joyous Mind.

source: རིགས་ནི་རྒྱལ་རིགས་འོད་ནི་དཔག་ཚད་གཅིག །སྦྱིན་སྲེག་འོད་འཕྲོ་ཡབ་ཡིན་ཆོས་བཟང་ཡུམ། །
en: His family will be kṣatriya and his light will extend a league. “Radiant Sacrifice will be his father and Dharma Excellence his mother.

source: ལེགས་པའི་ལྷ་ཞེས་བྱ་བ་སྲས་ཡིན་ནོ། །
en: God of Excellence will be his son

source: སྙིང་སྟོབས་མཆོག་ཅེས་བྱ་བ་རིམ་གྲོ་པ། །
en: And Supreme Courage his attendant.

source: ཟླ་སྡུག་ཅེས་ནི་བྱ་བ་ཤེས་རབ་ཅན། །
en: Beautiful Moon will be the one of insight

source: ཐུབ་མེད་སྟོབས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Indomitable Strength the one of miracles.

source: འདུས་པ་དང་པོར་འཇིགས་མེད་ཚོགས་པ་དག །སྟོང་ཕྲག་ལྔ་བཅུ་རྩ་དྲུག་གཉིས་པར་ཡང་། །དྲུག་ཅུ་གསུམ་པ་དག་ཏུ་དྲུག་ཅུ་ལྔ། །
en: In the first congregation of the fearless Will be fifty-six thousand. In the second there will be sixty thousand, and in the third there will be sixty-five thousand.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་གཉིས། །
en: “His lifespan will be twenty-two thousand years,

source: ས་བདག་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་བརྒྱད་ཅུར་གནས། །
en: And when this lord of the land has attained parinirvāṇa His sacred Dharma will remain for eighty thousand years.

source: མཆོད་རྟེན་བྱེ་བ་དྲུག་ཅུ་ཐམ་པ་ལ། །གདུགས་དང་རྒྱལ་མཚན་ཟླ་གམ་དག་གིས་བརྒྱན། །
en: There will be six hundred million stūpas “Adorned with parasols, banners, and half-moons.

source: དེ་བཞིན་གཤེགས་པ་སྒྲོན་མ་ཆེན་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་བཟང་ཞེས་བྱ། །
en: The thus-gone Mahāpradīpa will be born In a place called Excellent Joy.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་ཡབ་ནི་སྤྱན་ལེགས་ཡིན། །དེ་ཡི་ཡུམ་ནི་ཡན་ལག་མཆོག་ཅེས་བྱ། །
en: His family will be brahmin, “And his light will extend seventy leagues. Excellent Eye will be his father and Supreme Branches his mother.

source: སྲས་པོ་དབྱངས་སྙན་དགེ་བ་རིམ་གྲོ་པ། །
en: Beautiful Melody will be his son and Virtue his attendant.

source: དོན་ལེགས་སྤྱོད་ཅེས་བྱ་བ་ཤེས་རབ་ཅན། །
en: Practice of the Good Objective will be the one of insight

source: དྲང་སྲོང་བྱིན་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་མཆོག །
en: “And Given by the Sages the one of miracles.

source: དྲང་སྲོང་དགེ་འདུན་བྱེ་བ་བརྒྱ་ཕྲག་གསུམ། །གཉིས་པར་གཉིས་ཡོད་གསུམ་པར་གཅིག་ཡོད་དོ། །
en: The sages of the saṅgha who participate in the first congregation Will number three billion. In the second will be two billion, and in the third there will be one billion.

source: དེ་ཚེ་མི་དེ་དག་གི་ཚེ་ཡི་ཚད། །ལོ་གྲངས་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་ཡང་དྲུག །
en: “At that time, the lifespan of humans Will be eighty-six thousand years,

source: དེ་ཡི་དམ་ཆོས་ལོ་གྲངས་བྱེ་བར་གནས། །
en: And the sacred Dharma will remain for ten million years.

source: སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་གཅིག་འབྱུང་ལ། །དཔག་ཚད་གསུམ་ཙམ་ཁོར་ཡུག་གདུགས་སྟོང་གིས། །བརྒྱན་ཅིང་རིན་ཆེན་དྲ་བ་དག་གིས་ཁྱབ། །
en: His relics will remain in one collection and there will be a single stūpa, “Measuring three leagues and adorned By a thousand parasols and jewel nets.

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་འོད་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་དགའ་ཞེས་བྱ། །
en: The thus-gone Lokaprabha will be born In a place called Joyous World.

source: རིགས་ནི་བྲམ་ཟེ་འོད་ནི་དཔག་ཚད་གཅིག །
en: “His family will be brahmin, And his light will extend one league.

source: དེ་ཡི་ཡབ་ནི་བཟང་པོ་དཔལ་ཞེས་བྱ། །སྣ་མའི་མེ་ཏོག་དྲི་ལྡན་དེ་ཡི་ཡུམ། །
en: Glorious Excellence will be his father and Jasmine Flower his mother.

source: སྐྱེ་བོ་དགའ་བ་སྲས་མེ་རིམ་གྲོ་པ། །
en: Delighting People will be his son and Fire his attendant.

source: ཚོགས་རྒྱལ་དགའ་བ་དྲང་སྲོང་ཤེས་རབ་ཅན། །
en: “Joyous Sage of Victorious Gatherings will be the one of insight

source: བསྙེན་པར་གྲགས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Fame the one of miracles.

source: རྐང་གཉིས་མཆོག་མའི་འདུས་པ་དང་པོར་ནི། །དགེ་སློང་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་ཐམ། །འདུས་པ་གཉིས་པར་དགུ་བཅུ་རྩ་བརྒྱད་དོ། །གསུམ་པར་འཁོར་ནི་དགུ་བཅུ་རྩ་ཡང་བདུན། །
en: In the first congregation of this supreme human Will be ninety-nine thousand monks. “In the second will be ninety-eight thousand, And in the third there will be ninety-seven thousand.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ། །དམ་པའི་ཆོས་ནི་དེ་ཡི་ལྔ་འགྱུར་གནས། །
en: His lifespan will be twenty-five thousand years, And the sacred Dharma will remain for five times as long.

source: སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་ཕལ་ཆེ་སྟེ། །བྱེ་བ་དགུ་བཅུ་རྩ་གཉིས་རྒྱན་གྱིས་བརྒྱན། །
en: “His relics will be abundant, and the great ornamented stūpas Will number nine hundred twenty million.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་དྲི་ཞིམ་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྤོས་ཀྱིས་བརྒྱན་ཞེས་བྱ། །
en: The thus-gone Surabhigandha will be born In a place called Incense Ornament.

source: རིགས་ནི་རྒྱལ་རིགས་འོད་ནི་གླིང་ཆེན་དག །སྟོང་ཕྲག་གསུམ་ཁྱབ་ཡབ་ནི་བསོད་ནམས་བཟང་། །འགྲོ་བ་འཛིན་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be kṣatriya, And his light will span three thousand continents. Excellent Merit will be his father and World Holder his mother.

source: སྲས་པོ་ལེགས་མཐོང་ལྷུན་པོ་རིམ་གྲོ་པ། །
en: Excellent Sight will be his son and Mountain his attendant.

source: གང་ཟག་མཆོག་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Supreme Person will be the scholar

source: ལྷ་ཡིས་མཆོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Worshiped by Gods the one of miracles.

source: དགྲ་བཅོམ་འདུས་པ་བྱེ་བ་ཕྲག་བཞི་ཡོད། །གཉིས་པར་གསུམ་ཡོད་གསུམ་པར་གཉིས་ཡོད་དོ། །
en: Forty million worthy ones will gather in the first congregation. “In the second will be thirty million, and twenty million in the third.

source: དེ་ན་མི་དེ་དག་གི་ཚེ་ཡི་ཚད། །ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་ཡང་གཉིས། །
en: The lifespan of humans will be ninety-two thousand years.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །སངས་རྒྱས་ཞིང་དུ་ལོ་བྱེ་གཉིས་སུ་གནས། །
en: The sacred Dharma will remain in his buddha realm For twenty million years after he has passed beyond.

source: མཆོད་རྟེན་གཅིག་འབྱུང་དཔག་ཚད་དྲུག་ཙམ་གྱི། །ཁྱོན་ཀུན་རིན་པོ་ཆེ་ཡིས་ཁྱབ་པར་འགྱུར། །
en: “There will be a single stūpa measuring six leagues And adorned with ornaments throughout.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མཆོག་འཛིན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བས་བརྒྱན་ཞེས་བྱ། །
en: The thus-gone Guṇāgradhārin will be born In a place called Adorned with Joy.

source: མི་མཆོག་རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་ཏེ། །
en: “The family of this supreme human will be kṣatriya

source: འོད་ནི་རྒྱང་གྲགས་གསུམ་ཡོད་མེ་ཏོག་ཡབ། །དེ་ཡི་ཡུམ་ནི་བདེ་བར་བྱེད་ཅེས་བྱ། །
en: And his light will span three krośas. Flower will be his father and Bliss Maker his mother.

source: སྲས་པོ་འབྱོར་ལྡན་འབྲུག་སྒྲ་རིམ་གྲོ་པ། །
en: Wealthy will be his son and Sound of Thunder his attendant.

source: དེ་ཚེ་གྲགས་མཆོག་ཅེས་བྱ་ཤེས་རབ་ཅན། །
en: “At that time Supreme Fame will be the one of insight

source: འོད་བྱེད་ཅེས་བྱ་རྫུ་འཕྲུལ་ལྡན་པ་ཡིན། །
en: And Radiant the one of miracles.

source: དགྲ་བཅོམ་འདུས་པ་བྱེ་བ་བརྒྱ་ཕྲག་གཉིས། །དེ་ཚེ་འདུས་པ་གཉིས་པར་དེ་ལྔ་བསྒྱུར། །གསུམ་པར་ཚོགས་པ་བྱེ་སྟོང་བཅུ་གསུམ་ཡོད། །
en: Two billion worthy ones will gather in the first congregation. In the second will be five billion, “And in the third will be hundred thirty billion.

source: དེ་ཚེ་སྐུ་ཚེ་ལོ་གྲངས་བྱེ་བ་གསུམ། །
en: The lifespan then will be thirty million years,

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་ལྔ་བརྒྱར་གནས། །
en: And the sacred Dharma will remain for five hundred years.

source: དེ་ཡི་སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་ཡང་། །དཔག་ཚད་གཉིས་པ་གདུགས་ནི་སྟོང་ཕྲག་བརྒྱས། །བརྒྱན་ཅིང་རིན་ཆེན་མེ་ཏོག་དག་གིས་གང་། །
en: There will be a single collection of relics “And the stūpa will be two leagues tall, Adorned with a hundred thousand parasols, ornaments, and precious flowers.

source: དེ་བཞིན་གཤེགས་པ་མུན་དང་བྲལ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་ལྡན་ཞེས་བྱ། །
en: The thus-gone Vigatatamas will be born In a place called Endowed with Merit.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་བཞི་དྲང་སྲོང་ཆེན་པོ་ཡབ། །ཤིན་ཏུ་བཀྲ་ཤིས་ཞེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: “His family will be brahmin, And his light will extend fourteen leagues. Great Sage will be his father and Perfectly Auspicious his mother.

source: སྲས་པོ་ཆོས་སྨྲ་ངོས་བཟངས་རིམ་གྲོ་པ། །
en: Dharma Speaker will be his son and Fine Face his attendant.

source: དཔལ་བཟང་ཞེས་བྱ་མཁས་པ་ཆེན་པོ་སྟེ། །
en: “Excellent Glory will be the great scholar

source: ཡོན་ཏན་འབྱུང་གནས་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Source of Qualities the one of miracles.

source: འདུས་པ་དང་པོར་བྱེ་བ་དགུ་བཅུ་གཉིས། །འདུས་པ་གཉིས་པར་བྱེ་བ་བདུན་ཅུ་ཡོད། །གསུམ་པར་བྱེ་བ་བདུན་ཅུ་རྩ་དྲུག་ཡོད། །
en: In the first congregation there will nine hundred ten million, In the second there will be seven hundred million, “And in the third there will be will seven hundred sixty million.

source: སྐུ་ཚེ་ལོ་གྲངས་ལྔ་བརྒྱ་ཐམ་པ་ཡིན། །
en: His lifespan will be five hundred years,

source: འཇིག་རྟེན་རྣམ་པར་འདྲེན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཞི་བཅུ་དྲུག་ཏུ་གནས། །
en: And the sacred Dharma of this guide of the world Will remain for forty-six thousand years.

source: དེ་ཡི་སྐུ་གདུང་རྣམས་ཀྱང་རྒྱས་འགྱུར་ལ། །རྒྱལ་མཚན་བཟང་པོ་བྱེ་བ་བརྒྱད་ཅུས་གང་། །
en: “His relics will be abundant And adorned with eight hundred million fine banners.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་འགྲམ་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགེ་དང་ལྡན་ཞེས་བྱ། །
en: The thus-gone Siṃhahanu will be born At a place called Endowed with Virtue.

source: དེའི་རིགས་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་གཉིས་ཡབ་ནི་ལེགས་ཡིད་གཞུངས། །བདེ་འོད་ཅེས་བྱ་ཡུམ་ཡིན་སྲས་པོ་ནི། །ཡོན་ཏན་རྒྱལ་མཚན་བདེན་པ་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend twelve leagues. Fine and Noble Mind will be his father and Light of Bliss his mother. Banner of Excellent Qualities will be his son and Truth his attendant.

source: ཆོས་འདོད་ཅེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: “Dharma Wish will be the scholar

source: འགྲོ་བའི་མཆོད་རྟེན་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Stūpa for the World the one of miracles.

source: དྲང་སྲོང་ཡིད་ཞི་དགེ་འདུན་འདུས་པ་རྣམས། །སྟོང་ཕྲག་བརྒྱད་ཅུ་དག་ནི་འབྱུང་བར་འགྱུར། །
en: Eighty thousand serene sages Will gather in the first congregation of the saṅgha.

source: དམ་པའི་ཆོས་ནི་ལོ་གྲངས་བདུན་ཁྲིའི་བར། །གནས་པར་འགྱུར་རོ་སྐུ་གདུང་འཕེལ་བར་འགྱུར། །
en: “The sacred Dharma will remain for seventy thousand years, And his relics will multiply.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གྲགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་སྙིང་པོ་ཡིན། །
en: The thus-gone Ratnakīrti will be born In a place called Essence of Merit.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་ཡབ་ནི་ལེགས་བཟངས་ཡིན། །
en: “His family will be brahmin, And his light will extend seventy leagues. Exquisite Excellence will be his father

source: རིན་ཆེན་གཙུག་ཏོར་ཞེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: And Jewel Uṣṇīṣa his mother.

source: རི་མཆོག་སྲས་ཡིན་རྒྱལ་ནི་རིམ་གྲོ་པ། །
en: “Supreme Mountain will be his son and Conqueror his attendant.

source: ཤེས་རབ་སྒྲོན་མ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Lamp of Insight will be the scholar

source: གཙུག་ན་ནོར་བུ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Crown Jewel the one of miracles.

source: འདུས་པ་དང་པོར་སྲིད་པ་ཟད་པ་དག །ཐེར་འབུམ་ཡོད་དོ་གཉིས་པར་ལྔ་ཡང་ཡོད། །གསུམ་པ་དག་ཏུ་ཐེར་འབུམ་ཕྲག་ཀྱང་དགུ། །
en: In the first congregation there will be one billion who have exhausted existence; In the second will be five billion; “And in the third there will be nine billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་གྲངས་སྟོང་ཡང་ཡིན། །
en: His lifespan will be one thousand years,

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །
en: And after this knower of the world has attained nirvāṇa

source: དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་བཅུར་ཡང་གནས། །
en: The sacred Dharma will remain for ten thousand years.

source: རིན་ཆེན་བདུན་པོ་ཀུན་གྱི་རྒྱུས་བྱུང་བ། །མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་ཡང་འབྱུང་། །
en: “There will be ten billion stūpas Made of the seven precious substances.

source: དེ་བཞིན་གཤེགས་པ་སྐྱོན་རབ་ཞི་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བར་བྱེད་ཅེས་བྱ། །
en: The thus-gone Praśāntadoṣa will be born At a place called Joyful.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་བཅུ་གཉིས་ཡོད་འབྱོར་ལྡན་ཡབ། །དེ་ཡི་ཡུམ་ནི་བཟང་ལྡན་མ་ཞེས་བྱ། །
en: “His family will be brahmin, And his light will extend ninety-two leagues. Wealthy will be his father and Endowed with Excellence his mother.

source: དབྱངས་སྙན་སྲས་པོ་གསལ་བ་རིམ་གྲོ་པ། །
en: Beautiful Melody will be his son and Luminous his attendant.

source: ཆོས་དཔལ་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Light of Dharma Glory will be the scholar

source: དོན་སྨྲ་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Meaningful Speech the one of miracles.

source: འདུས་པ་དང་པོར་རྫུ་འཕྲུལ་སྟོབས་ཅན་དག །དགྲ་བཅོམ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་གསུམ་ཡོད། །
en: In the first congregation there will be sixty-three thousand Worthy ones with powerful miraculous abilities.

source: གཉིས་པར་དྲུག་ཅུ་རྩ་གཉིས་ཐམ་པར་ཡོད། །འདུས་པ་གསུམ་པར་དྲུག་ཅུ་རྩ་ཡང་གཅིག །
en: “In the second will be sixty-two thousand And in the third there will be sixty-one thousand.

source: དེ་ཚེ་ལོ་ནི་སྟོང་ཕྲག་དགུ་བཅུ་དྲུག །དེ་སྲིད་དུས་སུ་དམ་པའི་ཆོས་ནི་ལོ། །བྱེ་ཕྲག་གཉིས་གནས་སྟོན་པ་མྱ་ངན་འདས། །སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་གཅིག་བྱུང་ངོ་། །
en: At that time the lifespan will be ninety-six thousand years, And the sacred Dharma will remain for twenty million years. “In a single stūpa dedicated to the teacher’s nirvāṇa The relics will remain as a single collection.

source: དེ་བཞིན་གཤེགས་པ་བདུད་རྩི་འཆང་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བཟང་དང་ལྡན་ཞེས་བྱ། །
en: The thus-gone Amṛtadhārin will be born In a place called Endowed with Excellence.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་དྲུག་ཡབ་ནི་ཚངས་བཟངས་ཡིན། །མེ་ཏོག་ཅན་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be brahmin, And his light will extend sixteen leagues. Excellent Brahmā will be his father and Endowed with Flowers his mother.

source: སྲས་པོ་ཟླས་བྱིན་རྒྱལ་དབང་རིམ་གྲོ་པ། །
en: Moon Gift will be his son and Powerful Conqueror his attendant.

source: ཡེ་ཤེས་འོད་གསལ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Luminous Wisdom will be the scholar

source: འོད་པོ་ཆེ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Great Light the one of miracles.

source: འདུས་པ་དང་པོར་དགྲ་བཅོམ་ཐེར་འབུམ་དགུ། །གཉིས་པར་བརྒྱད་ཡོད་གསུམ་པ་དག་ཏུའང་བརྒྱད། །
en: In the first congregation there will be nine billion worthy ones, In the second there will be eight billion, and in the third there will be likewise eight billion.

source: དེ་ཚེ་སངས་རྒྱས་མཆོག་མའི་སྐུ་ཚེའི་ཚད། །ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་དྲུག་ཡིན། །
en: “The lifespan of the supreme buddha of that time Will be seventy-six thousand years,

source: བདེ་གཤེགས་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་པའི་ཆོས་ནི་ལོ་གྲངས་བྱེ་བར་གནས། །
en: And after this well-gone one has attained parinirvāṇa The sacred Dharma will remain for ten million years.

source: མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུ་དགུ། །རིན་པོ་ཆེ་ཡི་གདུགས་ཀྱིས་བརྒྱན་པར་འགྱུར། །
en: “There will be nine hundred ninety billion stūpas Adorned with jeweled parasols.

source: དེ་བཞིན་གཤེགས་པ་མི་ཡི་ཟླ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་སྩོགས་ཞེས་བྱ། །
en: The thus-gone Manujacandra will be born In a place called Joyous Gathering.

source: དེའི་རིགས་བྲམ་ཟེ་འོད་ནི་དཔག་ཚད་གཅིག །
en: “His family will be brahmin and his light will extend one league.

source: བདེ་བར་གཤེགས་པའི་ཡབ་ནི་བཟང་པོ་ཡིན། །
en: Excellent will be this well-gone one’s father

source: སྤྲིན་ལྡན་མ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: And Cloud Bearer his mother.

source: རིན་ཆེན་མཆོག་མ་ཤེས་རབ་གཏམ་ལྡན་ཏེ། །
en: “Supreme Jewel will be the teacher of insight

source: འཛམ་བུའི་ཆུ་བོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Jambu River the one of miracles.

source: དགྲ་བཅོམ་བྱེ་བ་སྟོང་ཕྲག་བཅུ་ཡོད་དེ། །གཉིས་པར་བརྒྱད་ཡོད་གསུམ་པར་དགྲ་བཅོམ་པ། །དེ་དག་བྱེ་བརྒྱ་ལྔ་བཅུ་རྩ་ལྔ་ཡོད། །
en: In the first congregation there will be one hundred billion worthy ones, In the second there will be eighty billion, “And in the third there will be fifty-five billion.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བརྒྱ་དྲུག་ཅུ། །
en: His lifespan will be six million years,

source: བདེ་བར་གཤེགས་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་གཉིས་སུ་གནས། །
en: And after this well-gone one has attained nirvāṇa The sacred Dharma will remain for twenty million years.

source: རྒྱལ་བའི་མཆོད་རྟེན་བྱེ་བ་བདུན་ཅུ་དྲུག །འཇིག་རྟེན་གསུམ་དུ་སིལ་སྙན་བརྒྱ་ཡང་གྲགས། །
en: “There will be seven hundred sixty million stūpas And hundreds of cymbals will ring throughout the three worlds.

source: དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་གཟིགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྐྱེད་པར་ལྡན་ཞེས་བྱ། །
en: The thus-gone Sudarśana will be born In a place called Endowed with Produce.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་བསོད་ནམས་བཟང་པོ་ཡབ། །དེ་ཡི་ཡུམ་ནི་སྙན་པར་སྨྲ་ཞེས་བྱ། །
en: “His family will be kṣatriya, And his light will extend ten leagues. Excellent Merit will be his father and Delightful Speech his mother.

source: སྲས་པོ་ཆོས་བཟང་ཟླ་བ་རིམ་གྲོ་པ། །
en: Dharma Excellence will be his son and Moon his attendant.

source: ཤེས་རབ་མཐར་ཕྱིན་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Perfection of Insight will be the scholar

source: གཏམ་ལྡན་གཙོ་བོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Foremost Speaker the one of miracles.

source: འདུས་པ་དང་པོར་རྒ་ནད་སེལ་བ་པོ། །དགྲ་བཅོམ་བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་ཡོད། །འདུས་པ་གཉིས་པར་བྱེ་བ་བརྒྱད་ཅུ་ཡོད། །གསུམ་པར་ཚོགས་པ་བྱེ་བ་བརྒྱད་ཅུ་བདུན། །
en: In the first congregation there will be nine hundred million Worthy ones who have overcome aging and disease. “In the second congregation there will be eight hundred million, And in the third there will be eight hundred seventy million.

source: མི་རྣམས་ཚེ་ཚད་བྱེ་བ་ཕྲག་བརྒྱ་ཡིན། །
en: The lifespan of humans will be one billion years,

source: དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་བརྒྱད་དུ་གནས། །
en: And the sacred Dharma will remain for eighty million years.

source: སྟོན་པ་མྱ་ངན་འདས་པའི་མཆོད་རྟེན་དག །
en: “The stūpas of the teacher’s nirvāṇa

source: བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་གསུམ་འབྱུང་། །
en: Will number seven hundred thirty billion.

source: དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་བརྒྱན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོད་པའི་རྟེན་ཞེས་བྱ། །
en: The thus-gone Pratimaṇḍita will be born In a place called Stūpa.

source: རྒྱལ་བ་དེའི་རིགས་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཡོད་ཡབ་ནི་ལྷ་བཟང་ཡིན། །གཟི་ལྡན་མ་ནི་ཡུམ་ཡིན་སྲས་པོ་ནི། །མྱ་ངན་མེད་པ་ཐུབ་མེད་རིམ་གྲོ་པ། །
en: “His family will be brahmin, And his light will extend seven leagues. Divine Excellence will be his father and Splendid his mother. Free from Suffering will be his son and Indomitable his attendant.

source: གཞན་འཇོམས་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Defeater of Others will be the scholar

source: ང་རོ་སྙན་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Delightful Roar the one of miracles.

source: འདུས་པ་དང་པོར་སྲིད་པ་མཐར་བྱེད་པ། །ཞི་བར་སོང་བ་བྱེ་བ་བདུན་ཅུ་གཉིས། །གཉིས་པར་བྱེ་བ་བདུན་ཅུ་རྩ་གཅིག་ཡོད། །གསུམ་པར་ང་རྒྱལ་གཅོགས་པ་བདུན་ཅུ་ཡོད། །
en: In the first congregation there will be seven hundred twenty million Liberators from existence who have reached peace. “In the second congregation will be seven hundred ten million, And in the third there will be seven hundred million who have crushed pride.

source: འཇིག་རྟེན་མཁྱེན་པའི་སྐུ་ཚེའི་ཚད་དག་ནི། །ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་ཡིན། །
en: The lifespan of this knower of the world Will be ninety-nine thousand years.

source: མྱ་ངན་འདས་ནས་དམ་ཆོས་ལོ་གྲངས་དག །བྱེ་བར་གནས་འགྱུར་སྐུ་གདུང་དབྱེར་མེད་དོ། །
en: “After his nirvāṇa, the sacred Dharma Will remain for ten million years and the relics will not be dispersed.

source: དེ་བཞིན་གཤེགས་པ་ནོར་བུའི་འོད་སྐྱེ་བའི། །ཡུལ་ནི་མེ་ཏོག་ལེགས་རྒྱས་གཟི་བརྗིད་ཡིན། །
en: The thus-gone Maṇiprabha will be born In a place called Splendor of Blooming Flowers.

source: དེའི་རིགས་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ཟླ་བཟང་ཡིན། །དེ་ཡི་ཡུམ་ནི་རིན་ཆེན་ཟླ་ཞེས་བྱ། །
en: “His family will be kṣatriya, And his light will extend ten leagues. Excellent Moon will be his father and Jewel Moon his mother.

source: སྲས་པོ་སྐལ་འདོད་ཏོག་ནི་རིམ་གྲོ་པ། །
en: Fortunate Wish will be his son and Crest his attendant.

source: སྨན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “King of Medicine will be the scholar

source: སྐྱེ་བོ་དགའ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Delighting People the one of miracles.

source: འདུས་པ་དང་པོར་དྲང་སྲོང་དགྲ་བཅོམ་པ། །དགེ་སློང་བྱེ་བ་སྟོང་ཕྲག་དགུ་ཡོད་དོ། །གཉིས་པར་བརྒྱད་ཡོད་གསུམ་པར་བདུན་ཡང་ཡོད། །
en: In the first congregation there will be ninety billion Monks who are worthy sages. “In the second congregation will be eighty billion, and in the third there will be seventy billion.

source: བདེ་གཤེགས་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བྱེ་བ་གསུམ་དུ་ཉམས་མེད་གནས། །
en: And after this well-gone one has attained nirvāṇa The sacred Dharma will remain intact for thirty million years.

source: མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུ་དགུ། །འབྱུང་བར་འགྱུར་ལ་ཅོད་པན་དག་གིས་བརྒྱན། །
en: “There will be nine hundred ninety billion stūpas Adorned with crowns.

source: སངས་རྒྱས་རི་བོ་བརྩེགས་པའི་ཏོག་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཙན་དན་ཞེས་ཀྱང་བྱ། །
en: The buddha Girikūṭaketu will be born In a place called Sandalwood.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་ཡབ་ནི་ན་ཚོད་བཟང་། །མེ་ཏོག་མཆོག་ཅེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be brahmin, And his light will extend seventy leagues. Excellent Youth will be his father and Supreme Flower his mother.

source: སྲས་པོ་འོད་འཆང་ཆོས་མཆོག་རིམ་གྲོ་པ། །
en: Light Holder will be his son and Supreme Dharma his attendant.

source: ཆོས་ཀྱི་སྒྲོན་མ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Dharma Lamp will be the scholar

source: འོད་འགྲོ་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Luminous Movement the one of miracles.

source: འདུས་པ་དང་པོར་ལུས་ནི་སིལ་བ་པོ། །བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་བཞི་འབྱུང་། །གཉིས་པར་གསུམ་ཡོད་གསུམ་པར་གཉིས་འབྱུང་ངོ་། །
en: In the first congregation will gather Seven hundred forty billion who have relinquished the body. “In the second will be seven hundred thirty billion, and in the third seven hundred twenty billion.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུ་ཡིན། །
en: His lifespan will be seventy thousand years,
